import { ITimeline } from '../store/types';

export const mockTimelines: ITimeline[] = [
  {
    id: 1,
    topic: 'Кино',
    yearFrom: 1987,
    yearTo: 1991,
    slides: [
      { id: 1, year: 1987, text: 'Выход фильма "Робокоп"' },
      { id: 2, year: 1988, text: 'Выход фильма "Детские игры"' },
      { id: 3, year: 1989, text: 'Выход фильма "Бэтмен" Тим Бёртон' },
      { id: 4, year: 1990, text: 'Выход фильма "Огненные колесницы"' },
      { id: 5, year: 1991, text: 'Выход фильма "Терминатор 2"' },
    ],
  },
  {
    id: 2,
    topic: 'Литература',
    yearFrom: 1992,
    yearTo: 1997,
    slides: [
      { id: 1, year: 1992, text: 'Публикация романа "Американский психопат"' },
      { id: 2, year: 1993, text: 'Выход книги "Гарри Поттер и философский камень"' },
      { id: 3, year: 1994, text: 'Роман "Мемуары гейши" опубликован' },
      { id: 4, year: 1995, text: 'Премия Ман Букер присуждена' },
      { id: 5, year: 1997, text: 'Публикация книги "Гарри Поттер и Тайная комната"' },
    ],
  },
  {
    id: 3,
    topic: 'Искусство',
    yearFrom: 1999,
    yearTo: 2004,
    slides: [
      { id: 1, year: 1999, text: 'Выставка современного искусства в Лондоне' },
      { id: 2, year: 2000, text: 'Новая коллекция Пикассо' },
      { id: 3, year: 2001, text: 'Выставка инсталляций в Нью-Йорке' },
      { id: 4, year: 2003, text: 'Современные художники Азии' },
      { id: 5, year: 2004, text: 'Выставка "Модернизм и постмодернизм"' },
    ],
  },
  {
    id: 4,
    topic: 'Музыка',
    yearFrom: 2005,
    yearTo: 2009,
    slides: [
      { id: 1, year: 2005, text: 'Выход альбома Coldplay "X&Y"' },
      { id: 2, year: 2006, text: 'Концертная серия Beyoncé' },
      { id: 3, year: 2007, text: 'Выход альбома Radiohead "In Rainbows"' },
      { id: 4, year: 2008, text: 'Летние Олимпийские игры — музыкальное сопровождение' },
      { id: 5, year: 2009, text: 'Выход альбома Lady Gaga "The Fame Monster"' },
    ],
  },
  {
    id: 5,
    topic: 'Наука',
    yearFrom: 2010,
    yearTo: 2014,
    slides: [
      { id: 1, year: 2010, text: 'Запуск телескопа Kepler' },
      { id: 2, year: 2011, text: 'Открытие новых экзопланет' },
      { id: 3, year: 2012, text: 'Первый успешный полёт Dragon SpaceX' },
      { id: 4, year: 2013, text: 'Розетта достигает кометы 67P' },
      { id: 5, year: 2014, text: 'Новые разработки в области квантовых вычислений' },
    ],
  },
  {
    id: 6,
    topic: 'Спорт',
    yearFrom: 2015,
    yearTo: 2019,
    slides: [
      { id: 1, year: 2015, text: 'Чемпионат мира по лёгкой атлетике' },
      { id: 2, year: 2016, text: 'Летние Олимпийские игры в Рио' },
      { id: 3, year: 2017, text: 'Формула-1: чемпион Льюис Хэмилтон' },
      { id: 4, year: 2018, text: 'Чемпионат мира по футболу среди женщин' },
      { id: 5, year: 2019, text: 'NBA: титул Golden State Warriors' },
    ],
  },
];
